README.org
#+SETUPFILE: ./Setup/setupFile.org
#+OPTIONS: H:4 toc:t num:t \n:nil ::t |:t ^:{} -:t f:t *:t tex:t d:t tags:not-in-toc
#+HTML_HEAD_EXTRA: <style type="text/css"> blockquote {background:#EEEEEE; padding: 3px 13px}    </style>
#+HTML_HEAD_EXTRA: <style type="text/css"> pre {background:#EEEEEE; padding: 3px 13px}    </style>
#+TITLE: A small C++ linear algebra library

* Table of content                                           :TOC_3:noexport:
- [[#what-is-it][What is it?]]
- [[#examples][Examples]]
  - [[#vector-construction][Vector construction]]
    - [[#some-extra-constructors][Some extra "constructors"]]
  - [[#view-from-lowerupper-bounds][View from lower/upper bounds]]
  - [[#matrix-views][Matrix views]]
  - [[#creating-your-own-matrix-type-specialization][Creating your own matrix type specialization]]
  - [[#generic-view][Generic View]]
  - [[#conjugate-gradients][Conjugate gradients]]
  - [[#direct-call-to-lapack][Direct call to Lapack]]
- [[#doc-under-construction][Doc (Under construction)]]
  - [[#types][Types]]
    - [[#matrix-types][Matrix types]]
  - [[#meta-programming][Meta-Programming]]
    - [[#some-size-utils][Some size utils]]
    - [[#some-generic-matrix-type-predicates][Some generic matrix type predicates]]
  - [[#functions][Functions]]
    - [[#aliasing][Aliasing]]
    - [[#same-mathematical-object][Same mathematical object]]
    - [[#similar][Similar]]
    - [[#copy][Copy]]
    - [[#lowerupper-bound][lower/upper bound]]
- [[#faq][FAQ]]
  - [[#resizable-vectormatrix-][Resizable vector/matrix ?]]
  - [[#expression-template][Expression Template]]
  - [[#tiny-objects--intrinsics][Tiny objects & intrinsics]]

* What is it?

This is a light weight Linear Algebra C++17 library I am currently developing for my own stuff.

Early development stage *-> Do not use it right now!* 

The goals are:
- a good compromise between performance and library complexity
- shorter compilation time than libs like [[https://gitlab.com/libeigen/eigen][Eigen]] or [[https://bitbucket.org/blaze-lib/blaze/src/master/][Blaze]].
- a concise wrapping of libraries like [[https://github.com/xianyi/OpenBLAS][Blas]], [[https://github.com/flame/blis][Blis]], Lapacke, etc.

* Examples
** Vector construction
*** Some extra "constructors"

As this contructions is only available for "storable" vectors and not
views they are defined using =functions= (and not usual constructors).

#+BEGIN_SRC sh :wrap "src cpp :eval never" :results output :exports results
cat $(pwd)/examples/vector_extra_constructors.cpp
#+END_SRC

#+RESULTS:
#+BEGIN_src cpp :eval never
#include "LinearAlgebra/vector.hpp"

#include <array>
#include <vector>

using namespace LinearAlgebra;

int
main()
{
  // Construction of a dense vector using move(std::vector)
  //
  std::vector<int> data_1(4, 1);

  auto v_1 = create_vector(std::move(data_1));

  assert(data_1.size() == 0);
  static_assert(std::is_same_v<Vector<int>, decltype(v_1)>);

  std::cout << v_1 << std::endl;

  //================

  // Construction of a Tiny_Vector from a std::array copy
  //
  std::array<int, 4> data_2;
  for (auto& data_2_i : data_2) data_2_i = 2;

  auto v_2 = create_vector(data_2);

  static_assert(std::is_same_v<Tiny_Vector<int, 4>, decltype(v_2)>);

  std::cout << v_2 << std::endl;

  //================

  // Construction of a Tiny_Vector from a C array
  //
  auto v_3 = create_vector({3, 3, 3, 3});

  static_assert(std::is_same_v<Tiny_Vector<int, 4>, decltype(v_3)>);

  std::cout << v_3 << std::endl;
}
#+END_src

prints:

#+BEGIN_SRC sh :wrap "example :eval never" :results output :exports results
./build/examples/vector_extra_constructors
#+END_SRC

#+RESULTS:
#+BEGIN_example :eval never

1
1
1
1

2
2
2
2

3
3
3
3
#+END_example

** View from lower/upper bounds
   :PROPERTIES:
   :ID:       907674bf-2cae-4a34-8061-b5039240e93b
   :END:
   :BACKLINKS:
   [2020-05-08 Fri 12:03] <- [[id:3ba0b7cf-95c2-436e-a90c-11e751898497][lower/upper bound]]
   :END:

#+BEGIN_SRC sh :wrap "src cpp :eval never" :results output :exports results
cat $(pwd)/examples/lb_ub.cpp
#+END_SRC

#+RESULTS:
#+BEGIN_src cpp :eval never
#include "LinearAlgebra/vector.hpp"
#include "LinearAlgebra/utils/lower_upper_bound.hpp"

using namespace LinearAlgebra;

int
main()
{
  double data[13] = {1, 1, 2, 3, 3, 3, 3, 4, 4, 4, 5, 5, 6};
  auto X          = create_vector_view(data, 13);

  std::cout << X << std::endl;
  
  auto X_3 = create_vector_view(X, lower_bound(X, 3), upper_bound(X, 3));

  X_3=10;

  std::cout << X << std::endl;
}
#+END_src

prints:

#+BEGIN_SRC sh :wrap "example :eval never" :results output :exports results
./build/examples/lb_ub
#+END_SRC

#+RESULTS:
#+BEGIN_example :eval never

1
1
2
3
3
3
3
4
4
4
5
5
6

1
1
2
10
10
10
10
4
4
4
5
5
6
#+END_example

