docs/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-17 Fri 08:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A small C++ linear algebra library</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="picaud" />
</head>
<body>
<div id="content">
<h1 class="title">A small C++ linear algebra library</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1a0e2ed">1. What is it?</a></li>
<li><a href="#orgf7ddaf9">2. Examples</a>
<ul>
<li><a href="#orgb278a5c">2.1. Vector construction</a>
<ul>
<li><a href="#org7d06568">2.1.1. Some extra "constructors"</a></li>
</ul>
</li>
<li><a href="#org4187a60">2.2. View from lower/upper bounds</a></li>
<li><a href="#org746856d">2.3. Matrix views</a></li>
<li><a href="#org6622706">2.4. Creating your own matrix type specialization</a></li>
<li><a href="#org6600370">2.5. <span class="todo TODO">TODO</span> Generic View</a></li>
<li><a href="#org4610cd4">2.6. Conjugate gradients</a></li>
<li><a href="#orga0cc5a5">2.7. Direct call to Lapack</a></li>
</ul>
</li>
<li><a href="#orgb7d682a">3. Doc (Under construction)</a>
<ul>
<li><a href="#org1c19691">3.1. Types</a>
<ul>
<li><a href="#orgc62a4b4">3.1.1. Matrix types</a></li>
</ul>
</li>
<li><a href="#org14574a9">3.2. Meta-Programming</a>
<ul>
<li><a href="#orgc3077af">3.2.1. Some size utils</a></li>
<li><a href="#org954ade9">3.2.2. Some generic matrix type predicates</a></li>
</ul>
</li>
<li><a href="#org1d5d887">3.3. Functions</a>
<ul>
<li><a href="#org7c36b46">3.3.1. Aliasing</a></li>
<li><a href="#org381e2a6">3.3.2. Same mathematical object</a></li>
<li><a href="#orga1d6344">3.3.3. Similar</a></li>
<li><a href="#orgcc6bb79">3.3.4. Copy</a></li>
<li><a href="#org2b27d05">3.3.5. lower/upper bound</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5c310ea">4. FAQ</a>
<ul>
<li><a href="#org4be03e6">4.1. Resizable vector/matrix ?</a></li>
<li><a href="#org0b6c96b">4.2. Expression Template</a></li>
<li><a href="#orgea6fa12">4.3. Tiny objects &amp; intrinsics</a></li>
</ul>
</li>
</ul>
</div>
</div>

<p>
<a href="index.html"><b>HOME</b></a> 
</p>

<div id="outline-container-org1a0e2ed" class="outline-2">
<h2 id="org1a0e2ed"><span class="section-number-2">1</span> What is it?</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a light weight Linear Algebra C++17 library I am currently developing for my own stuff.
</p>

<p>
Early development stage <b>-&gt; Do not use it right now!</b> 
</p>

<p>
The goals are:
</p>
<ul class="org-ul">
<li>a good compromise between performance and library complexity</li>
<li>shorter compilation time than libs like <a href="https://gitlab.com/libeigen/eigen">Eigen</a> or <a href="https://bitbucket.org/blaze-lib/blaze/src/master/">Blaze</a>.</li>
<li>a concise wrapping of libraries like <a href="https://github.com/xianyi/OpenBLAS">Blas</a>, <a href="https://github.com/flame/blis">Blis</a>, Lapacke, etc.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf7ddaf9" class="outline-2">
<h2 id="orgf7ddaf9"><span class="section-number-2">2</span> Examples</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgb278a5c" class="outline-3">
<h3 id="orgb278a5c"><span class="section-number-3">2.1</span> Vector construction</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org7d06568" class="outline-4">
<h4 id="org7d06568"><span class="section-number-4">2.1.1</span> Some extra "constructors"</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
As this contructions is only available for "storable" vectors and not
views they are defined using <code>functions</code> (and not usual constructors).
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #cdad00;">#include</span> <span style="color: #8b7355;">"LinearAlgebra/vector.hpp"</span>

<span style="color: #cdad00;">#include</span> <span style="color: #8b7355;">&lt;array&gt;</span>
<span style="color: #cdad00;">#include</span> <span style="color: #8b7355;">&lt;vector&gt;</span>

<span style="color: #1c86ee;">using</span> <span style="color: #1c86ee;">namespace</span> <span style="color: #6e8b3d;">LinearAlgebra</span>;

<span style="color: #00688b;">int</span>
<span style="color: #cd9b1d;">main</span>()
{
  <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Construction of a dense vector using move(std::vector)</span>
  <span style="color: #7f7f7f;">//</span>
  <span style="color: #6e8b3d;">std</span>::<span style="color: #00688b;">vector</span>&lt;<span style="color: #00688b;">int</span>&gt; <span style="color: #2e8b57;">data_1</span>(4, 1);

  <span style="color: #1c86ee;">auto</span> <span style="color: #2e8b57;">v_1</span> = create_vector(<span style="color: #6e8b3d;">std</span>::move(data_1));

  assert(data_1.size() == 0);
  static_assert(<span style="color: #6e8b3d;">std</span>::<span style="color: #00688b;">is_same_v</span>&lt;<span style="color: #00688b;">Vector</span>&lt;<span style="color: #00688b;">int</span>&gt;, <span style="color: #1c86ee;">decltype</span>(v_1)&gt;);

  <span style="color: #6e8b3d;">std</span>::cout &lt;&lt; v_1 &lt;&lt; <span style="color: #6e8b3d;">std</span>::endl;

  <span style="color: #7f7f7f;">//</span><span style="color: #7f7f7f;">================</span>

  <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Construction of a Tiny_Vector from a std::array copy</span>
  <span style="color: #7f7f7f;">//</span>
  <span style="color: #6e8b3d;">std</span>::<span style="color: #00688b;">array</span>&lt;<span style="color: #00688b;">int</span>, 4&gt; <span style="color: #2e8b57;">data_2</span>;
  <span style="color: #1c86ee;">for</span> (<span style="color: #1c86ee;">auto</span>&amp; <span style="color: #2e8b57;">data_2_i</span> : data_2) data_2_i = 2;

  <span style="color: #1c86ee;">auto</span> <span style="color: #2e8b57;">v_2</span> = create_vector(data_2);

  static_assert(<span style="color: #6e8b3d;">std</span>::<span style="color: #00688b;">is_same_v</span>&lt;<span style="color: #00688b;">Tiny_Vector</span>&lt;<span style="color: #00688b;">int</span>, 4&gt;, <span style="color: #1c86ee;">decltype</span>(v_2)&gt;);

  <span style="color: #6e8b3d;">std</span>::cout &lt;&lt; v_2 &lt;&lt; <span style="color: #6e8b3d;">std</span>::endl;

  <span style="color: #7f7f7f;">//</span><span style="color: #7f7f7f;">================</span>

  <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Construction of a Tiny_Vector from a C array</span>
  <span style="color: #7f7f7f;">//</span>
  <span style="color: #1c86ee;">auto</span> <span style="color: #2e8b57;">v_3</span> = create_vector({3, 3, 3, 3});

  static_assert(<span style="color: #6e8b3d;">std</span>::<span style="color: #00688b;">is_same_v</span>&lt;<span style="color: #00688b;">Tiny_Vector</span>&lt;<span style="color: #00688b;">int</span>, 4&gt;, <span style="color: #1c86ee;">decltype</span>(v_3)&gt;);

  <span style="color: #6e8b3d;">std</span>::cout &lt;&lt; v_3 &lt;&lt; <span style="color: #6e8b3d;">std</span>::endl;
}
</pre>
</div>

<p>
prints:
</p>

<pre class="example">

1
1
1
1

2
2
2
2

3
3
3
3
</pre>
</div>
</div>
</div>

<div id="outline-container-org4187a60" class="outline-3">
<h3 id="org4187a60"><a id="ID-907674bf-2cae-4a34-8061-b5039240e93b"></a><span class="section-number-3">2.2</span> View from lower/upper bounds</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;Fri May  8 2020 12:03&gt;</span></span> &lt;- <a href="#org2b27d05">lower/upper bound</a>
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #cdad00;">#include</span> <span style="color: #8b7355;">"LinearAlgebra/vector.hpp"</span>
<span style="color: #cdad00;">#include</span> <span style="color: #8b7355;">"LinearAlgebra/utils/lower_upper_bound.hpp"</span>

<span style="color: #1c86ee;">using</span> <span style="color: #1c86ee;">namespace</span> <span style="color: #6e8b3d;">LinearAlgebra</span>;

<span style="color: #00688b;">int</span>
<span style="color: #cd9b1d;">main</span>()
{
  <span style="color: #00688b;">double</span> <span style="color: #2e8b57;">data</span>[13] = {1, 1, 2, 3, 3, 3, 3, 4, 4, 4, 5, 5, 6};
  <span style="color: #1c86ee;">auto</span> <span style="color: #2e8b57;">X</span>          = create_vector_view(data, 13);

  <span style="color: #6e8b3d;">std</span>::cout &lt;&lt; X &lt;&lt; <span style="color: #6e8b3d;">std</span>::endl;
  
  <span style="color: #1c86ee;">auto</span> <span style="color: #2e8b57;">X_3</span> = create_vector_view(X, lower_bound(X, 3), upper_bound(X, 3));

  X_3=10;

  <span style="color: #6e8b3d;">std</span>::cout &lt;&lt; X &lt;&lt; <span style="color: #6e8b3d;">std</span>::endl;
}
</pre>
</div>

<p>
prints:
</p>

<pre class="example">

1
1
2
3
3
3
3
4
4
4
5
5
6

1
1
2
10
10
10
10
4
4
4
5
5
6
</pre>
</div>
</div>
