README.org
** Matrix views 

#+BEGIN_SRC sh :wrap "src cpp :eval never" :results output :exports results
cat $(pwd)/examples/matrix_view.cpp
#+END_SRC

#+RESULTS:
#+BEGIN_src cpp :eval never
#include "LinearAlgebra/matrix.hpp"

using namespace LinearAlgebra;

int
main()
{
  Tiny_Matrix<int, 5, 6> mat;

  mat = 1;

  auto view_mat = create_matrix_view(mat, 1, 3, 2, 5);

  view_mat = -1;

  std::cout << "full matrix:" << mat << std::endl;

  //================

  Tiny_Symmetric_Matrix<int, 6> mat_S;

  create_matrix_view_full(mat_S) = 0;  // fill the full matrix

  mat_S = 1;  // here as mat_S is symmetric
              // only fill lower triangular part is filled

  // Take a subview of a _symmetric matrix_
  auto view_mat_S = create_matrix_view(mat_S, 1, 3, 1, 3);

  view_mat_S = -1;  // here the subview mat_S is symmetric too and
                    // only the lower triangular part will be filled

  std::cout << "full matrix:" << create_matrix_view_full(mat_S) << std::endl;
  std::cout << "submatrix:" << mat_S << std::endl;
}
#+END_src

prints:

#+BEGIN_SRC sh :wrap "example :eval never" :results output :exports results
./build/examples/matrix_view
#+END_SRC

#+RESULTS:
#+BEGIN_example :eval never
full matrix:
               1               1               1               1               1               1
               1               1              -1              -1              -1               1
               1               1              -1              -1              -1               1
               1               1               1               1               1               1
               1               1               1               1               1               1
full matrix:
               1               0               0               0               0               0
               1              -1               0               0               0               0
               1              -1              -1               0               0               0
               1               1               1               1               0               0
               1               1               1               1               1               0
               1               1               1               1               1               1
submatrix:
               1               X               X               X               X               X
               1              -1               X               X               X               X
               1              -1              -1               X               X               X
               1               1               1               1               X               X
               1               1               1               1               1               X
               1               1               1               1               1               1
#+END_example


** Creating your own matrix type specialization

You can define your own matrix type specialization:

#+BEGIN_SRC sh :wrap "src cpp :eval never" :results output :exports results
cat $(pwd)/examples/custom_matrix.cpp
#+END_SRC

#+RESULTS:
#+BEGIN_src cpp :eval never
#include "LinearAlgebra/matrix.hpp"

using namespace LinearAlgebra;

template <typename T>
using Matrix_nx2 =
    Default_Matrix<T,
                   Matrix_Special_Structure_Enum::None,       // Dense matrix
                   Matrix_Storage_Mask_Enum::None,            //
                   std::size_t,                               // Dynamic number of rows
                   std::integral_constant<std::size_t, 2>,    // Static number of columns, here 2
                   std::integral_constant<std::size_t, 10>>;  // Static leading dimension, here 10

// note: having a static leading dimension=10 allows to statically
//       allocate matrix, but this also limits max row size to 10.

static_assert(not Has_Static_I_Size_v<Matrix_nx2<int>>);
static_assert(Has_Static_J_Size_v<Matrix_nx2<int>>);

static_assert(Has_Static_Capacity_v<Matrix_nx2<int>>);
static_assert(Has_Static_Capacity_v<Tiny_Matrix<int, 2, 3>>);
static_assert(Has_Static_Capacity_v<Tiny_Vector<int, 2>>);

int
main()
{
  // Note:
  //
  // 1. M(5,3) would lead to run-time error in debug mode
  //    Reason: request 3 columns, 2 expected
  //
  // 2. M(15, 2) would lead to run-time error in debug mode
  //    Reason: number of rows > statically defined leading dimension
  //
  Matrix_nx2<double> M(5, 2);
  M = 0;

  // Note: one can also write
  // "create_vector_view_matrix_row(M,2)=2;"
  auto row_2 = create_vector_view_matrix_row(M, 2);
  row_2      = 2;

  auto col_1 = create_vector_view_matrix_column(M, 1);
  col_1      = 1;

  static_assert(Has_Static_Dimension_v<decltype(row_2)>);
  static_assert(not Has_Static_Dimension_v<decltype(col_1)>);

  std::cout << M;

  return 0;
}
#+END_src

** TODO Generic View
Easier interfacing with non generic code (.cpp files etc...).
  - [ ] add some examples

