docs/README.html

<div id="outline-container-org4610cd4" class="outline-3">
<h3 id="org4610cd4"><span class="section-number-3">2.6</span> Conjugate gradients</h3>
<div class="outline-text-3" id="text-2-6">
<p>
This is only for demo purpose as a real implementation makes more sense with sparse matrices + a preconditioner.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #cdad00;">#include</span> <span style="color: #8b7355;">"LinearAlgebra/matrix.hpp"</span>
<span style="color: #cdad00;">#include</span> <span style="color: #8b7355;">"LinearAlgebra/vector.hpp"</span>

<span style="color: #1c86ee;">using</span> <span style="color: #1c86ee;">namespace</span> <span style="color: #6e8b3d;">LinearAlgebra</span>;

<span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Basic CG implementation</span>
<span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">https://en.wikipedia.org/wiki/Conjugate_gradient_method</span>
<span style="color: #7f7f7f;">//</span>
<span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">A_IMPL</span>, <span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">X0_IMPL</span>, <span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">B_IMPL</span>&gt;
<span style="color: #00688b;">bool</span>
<span style="color: #cd9b1d;">cg</span>(<span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Matrix_Crtp</span>&lt;<span style="color: #00688b;">A_IMPL</span>&gt;&amp; <span style="color: #2e8b57;">A</span>, <span style="color: #00688b;">Dense_Vector_Crtp</span>&lt;<span style="color: #00688b;">X0_IMPL</span>&gt;&amp; <span style="color: #2e8b57;">X0</span>, <span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Dense_Vector_Crtp</span>&lt;<span style="color: #00688b;">B_IMPL</span>&gt;&amp; <span style="color: #2e8b57;">b</span>)
{
  <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Sanity checks</span>
  <span style="color: #7f7f7f;">//</span>
  assert(all_sizes_are_equal_p(A.I_size(), A.J_size(), X0.size(), b.size()));
  static_assert(<span style="color: #00688b;">Is_Symmetric_Matrix_v</span>&lt;<span style="color: #00688b;">A_IMPL</span>&gt; <span style="color: #1c86ee;">or</span> <span style="color: #00688b;">Is_Hermitian_Matrix_v</span>&lt;<span style="color: #00688b;">A_IMPL</span>&gt;);

  <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Parameters</span>
  <span style="color: #7f7f7f;">//</span>
  <span style="color: #1c86ee;">const</span> <span style="color: #00688b;">double</span> <span style="color: #2e8b57;">eps</span>         = 1e-6;
  <span style="color: #1c86ee;">const</span> <span style="color: #00688b;">double</span> <span style="color: #2e8b57;">squared_eps</span> = eps * eps;
  <span style="color: #1c86ee;">const</span> <span style="color: #00688b;">size_t</span> <span style="color: #2e8b57;">max_iter</span>    = 100;

  <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Working vector type</span>
  <span style="color: #7f7f7f;">//</span>
  <span style="color: #1c86ee;">using</span> <span style="color: #00688b;">element_type</span> = <span style="color: #00688b;">Common_Element_Type_t</span>&lt;<span style="color: #00688b;">A_IMPL</span>, <span style="color: #00688b;">X0_IMPL</span>, <span style="color: #00688b;">B_IMPL</span>&gt;;

  <span style="color: #1c86ee;">auto</span> <span style="color: #2e8b57;">r</span>  = similar(<span style="color: #00688b;">Type_v</span>&lt;<span style="color: #00688b;">element_type</span>&gt;, X0);
  <span style="color: #1c86ee;">auto</span> <span style="color: #2e8b57;">p</span>  = similar(r);
  <span style="color: #1c86ee;">auto</span> <span style="color: #2e8b57;">Ap</span> = similar(r);

  <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Initialization</span>
  <span style="color: #7f7f7f;">//</span>
  r = b - A * X0;

  <span style="color: #1c86ee;">auto</span> <span style="color: #2e8b57;">squared_norm_r_old</span> = dot(r, r);

  <span style="color: #1c86ee;">if</span> (squared_norm_r_old &lt; squared_eps)
  {
    <span style="color: #1c86ee;">return</span> <span style="color: #6e8b3d;">true</span>;
  }

  p = r;

  <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Main loop</span>
  <span style="color: #7f7f7f;">//</span>
  <span style="color: #1c86ee;">for</span> (<span style="color: #00688b;">size_t</span> <span style="color: #2e8b57;">i</span> = 0; i &lt; max_iter; i++)
  {
    Ap = A * p;

    <span style="color: #1c86ee;">auto</span> <span style="color: #2e8b57;">alpha</span> = squared_norm_r_old / dot(p, Ap);

    X0 = X0 + alpha * p;

    r = r - alpha * Ap;

    <span style="color: #1c86ee;">auto</span> <span style="color: #2e8b57;">squared_norm_r_new</span> = dot(r, r);

    <span style="color: #6e8b3d;">std</span>::cout &lt;&lt; <span style="color: #8b7355;">"iter "</span> &lt;&lt; i &lt;&lt; <span style="color: #8b7355;">" residue "</span> &lt;&lt; squared_norm_r_new &lt;&lt; <span style="color: #6e8b3d;">std</span>::endl;

    <span style="color: #1c86ee;">if</span> (squared_norm_r_new &lt; squared_eps)
    {
      <span style="color: #1c86ee;">return</span> <span style="color: #6e8b3d;">true</span>;
    }

    p = r + squared_norm_r_new / squared_norm_r_old * p;

    squared_norm_r_old = squared_norm_r_new;
  }
  <span style="color: #1c86ee;">return</span> <span style="color: #6e8b3d;">false</span>;
}

<span style="color: #00688b;">int</span>
<span style="color: #cd9b1d;">main</span>()
{
  <span style="color: #00688b;">Symmetric_Matrix</span>&lt;<span style="color: #00688b;">double</span>&gt; <span style="color: #2e8b57;">M</span>(10, 10);
  <span style="color: #00688b;">Vector</span>&lt;<span style="color: #00688b;">double</span>&gt; <span style="color: #2e8b57;">X0</span>(10);
  <span style="color: #00688b;">Vector</span>&lt;<span style="color: #00688b;">double</span>&gt; <span style="color: #2e8b57;">b</span>(10);

  M       = 1;
  M(6, 5) = 5; <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Note: in debug mode M(5, 6) = 2 would lead to an</span>
               <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">assert failure as by default symmetric matrices are</span>
               <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">stored into their lower part.</span>

  create_vector_view_matrix_diagonal(M) = 10;

  b  = 1;
  X0 = 0;

  <span style="color: #00688b;">bool</span> <span style="color: #2e8b57;">status</span> = cg(M, X0, b);

  <span style="color: #6e8b3d;">std</span>::cout &lt;&lt; X0 &lt;&lt; <span style="color: #6e8b3d;">std</span>::endl;
  <span style="color: #6e8b3d;">std</span>::cout &lt;&lt; <span style="color: #6e8b3d;">std</span>::boolalpha &lt;&lt; status &lt;&lt; <span style="color: #6e8b3d;">std</span>::endl;
}
</pre>
</div>

<p>
prints:
</p>

<pre class="example">
iter 0 residue 0.0652995
iter 1 residue 1.03037e-32

0.0543933
0.0543933
0.0543933
0.0543933
0.0543933
0.0376569
0.0376569
0.0543933
0.0543933
0.0543933
true
</pre>
</div>
</div>
