docs/README.html

<div id="outline-container-orga0cc5a5" class="outline-3">
<h3 id="orga0cc5a5"><span class="section-number-3">2.7</span> Direct call to Lapack</h3>
<div class="outline-text-3" id="text-2-7">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #cdad00;">#include</span> <span style="color: #8b7355;">"LinearAlgebra/lapack/lapack.hpp"</span>
<span style="color: #cdad00;">#include</span> <span style="color: #8b7355;">"LinearAlgebra/matrix.hpp"</span>
<span style="color: #cdad00;">#include</span> <span style="color: #8b7355;">"LinearAlgebra/vector.hpp"</span>

<span style="color: #1c86ee;">using</span> <span style="color: #1c86ee;">namespace</span> <span style="color: #6e8b3d;">LinearAlgebra</span>;

<span style="color: #00688b;">int</span>
<span style="color: #cd9b1d;">main</span>()
{
  <span style="color: #1c86ee;">const</span> <span style="color: #00688b;">size_t</span> <span style="color: #2e8b57;">n</span> = 5;

  <span style="color: #00688b;">Vector</span>&lt;<span style="color: #00688b;">double</span>&gt; <span style="color: #2e8b57;">v</span>(n), <span style="color: #2e8b57;">w</span>(n);
  v = 1;

  <span style="color: #00688b;">Symmetric_Matrix</span>&lt;<span style="color: #00688b;">double</span>&gt; <span style="color: #2e8b57;">M</span>(n, n);

  M                                     = 0;
  create_vector_view_matrix_diagonal(M) = 10;
  M(4, 0)                               = 5;

  w = M * v;

  <span style="color: #6e8b3d;">std</span>::cout &lt;&lt; <span style="color: #8b7355;">"symmetric M :"</span> &lt;&lt; M &lt;&lt; <span style="color: #6e8b3d;">std</span>::endl &lt;&lt; <span style="color: #6e8b3d;">std</span>::endl;
  <span style="color: #6e8b3d;">std</span>::cout &lt;&lt; <span style="color: #8b7355;">"v :"</span> &lt;&lt; v &lt;&lt; <span style="color: #6e8b3d;">std</span>::endl &lt;&lt; <span style="color: #6e8b3d;">std</span>::endl;
  <span style="color: #6e8b3d;">std</span>::cout &lt;&lt; <span style="color: #8b7355;">"w = M.v :"</span> &lt;&lt; w &lt;&lt; <span style="color: #6e8b3d;">std</span>::endl &lt;&lt; <span style="color: #6e8b3d;">std</span>::endl;

  <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Low level call of lapack: L*L^t decomposition</span>
  <span style="color: #7f7f7f;">//</span>
  <span style="color: #00688b;">int</span> <span style="color: #2e8b57;">info</span> = <span style="color: #6e8b3d;">Lapack</span>::potrf(M);
  assert(info == 0);

  <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Create a constant view defining L</span>
  <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">(symmetric matrix uses lower part)</span>
  static_assert(<span style="color: #00688b;">Is_Lower_Matrix_Storage_v</span>&lt;<span style="color: #1c86ee;">decltype</span>(M)&gt;);
  <span style="color: #7f7f7f;">//</span>
  <span style="color: #1c86ee;">auto</span> <span style="color: #2e8b57;">L</span> = create_matrix_view_lower_triangular(M.as_const());
  <span style="color: #6e8b3d;">std</span>::cout &lt;&lt; <span style="color: #8b7355;">"L :"</span> &lt;&lt; L &lt;&lt; <span style="color: #6e8b3d;">std</span>::endl &lt;&lt; <span style="color: #6e8b3d;">std</span>::endl;

  <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">inplace solve of w = M.v = L.L^t.v ...</span>
  <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">... at the end w "contains" v</span>
  <span style="color: #7f7f7f;">//</span>
  w = inverse(L) * w;             <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">L^(-1).w = L^t.v</span>
  w = inverse(transpose(L)) * w;  <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">L^(-t).L^(-1).w = v</span>

  <span style="color: #6e8b3d;">std</span>::cout &lt;&lt; <span style="color: #8b7355;">"v such that w=M.v :"</span> &lt;&lt; w &lt;&lt; <span style="color: #6e8b3d;">std</span>::endl;
}
</pre>
</div>

<p>
prints:
</p>

<pre class="example">
symmetric M :
              10               X               X               X               X
               0              10               X               X               X
               0               0              10               X               X
               0               0               0              10               X
               5               0               0               0              10

v :
1
1
1
1
1

w = M.v :
15
10
10
10
15

L :
         3.16228               X               X               X               X
               0         3.16228               X               X               X
               0               0         3.16228               X               X
               0               0               0         3.16228               X
         1.58114               0               0               0         2.73861

v such that w=M.v :
1
1
1
1
1
</pre>
</div>
</div>
</div>
