README.org
*** Matrix types 

 For the moment I only have defined =dense= matrices (BLAS compatible with column major order):

 #+BEGIN_SRC sh :wrap "src cpp :eval never" :results output :exports results
cat $(pwd)/examples/some_matrix_types.cpp
 #+END_SRC

 #+RESULTS:
 #+BEGIN_src cpp :eval never
 #include "LinearAlgebra/dense/matrix.hpp"
 #include "LinearAlgebra/dense/vector.hpp"

 #include <iostream>

 using namespace LinearAlgebra;

 int
 main()
 {
   Matrix<double> M_1(4, 5);

   Symmetric_Matrix<int> M_2(4, 4);

   Tiny_Strict_Lower_Triangular_Matrix<float, 4, 7> M_3;

   std::cout << M_1 << std::endl;
   std::cout << M_2 << std::endl;
   std::cout << M_3 << std::endl;
 }
 #+END_src

 prints

 #+BEGIN_SRC sh :wrap "example :eval never" :results output :exports results
./build/examples/some_matrix_types
 #+END_SRC

 #+RESULTS:
 #+BEGIN_example :eval never

		0               0               0               0               0
		0               0               0               0               0
		0               0               0               0               0
		0               0               0               0               0

		0               X               X               X
		0               0               X               X
		0               0               0               X
		0               0               0               0

		X               X               X               X               X               X               X
		0               X               X               X               X               X               X
		0               0               X               X               X               X               X
		0               0               0               X               X               X               X
 #+END_example

 The generic definition for these matrix types is:
 #+begin_src cpp :eval never
template <T,                  // is the component type
          SPECIAL_STRUCTURE,  // is in {None, Symmetric, Hermitian, Triangular,
                              //        Unit_Triangular, Triangular_Strict}
          MASK,               // is in {None, Upper, Upper_Strict, Lower, Lower_Strict }
          N_TYPE,             // std::size_t or a std::integral_constant<std::size_t,N>
          M_TYPE,             // std::size_t or a std::integral_constant<std::size_t,M>
          LEADING_DIMENSION   // std::size_t or a std::integral_constant<std::size_t,LD>
          >                   //
class Default_Matrix;         // or {Default_Matrix_View, Default_Matrix_Const_View}
 #+end_src

 There are some alias covering the usual cases:

 |------------------------------------------------------+-----------------------------------------------------------|
 | Dynamic                                              | Static                                                    |
 |------------------------------------------------------+-----------------------------------------------------------|
 | Matrix<T> M(I_size, J_size);                         | Tiny_Matrix<T, I_SIZE, J_SIZE> M;                         |
 | Symmetric_Matrix<T> M(I_size, J_size);               | Tiny_Symmetric_Matrix<T, SIZE> M;                         |
 | Hermitian_Matrix<T> M(I_size, J_size);               | Tiny_Hermitian_Matrix<T, SIZE> M;                         |
 | Lower_Triangular_Matrix<T> M(I_size, J_size);        | Tiny_Lower_Triangular_Matrix<T, I_SIZE, J_SIZE> M;        |
 | Upper_Triangular_Matrix<T> M(I_size, J_size);        | Tiny_Upper_Triangular_Matrix<T, I_SIZE, J_SIZE> M;        |
 | Lower_Triangular_Strict_Matrix<T> M(I_size, J_size); | Tiny_Lower_Triangular_Strict_Matrix<T, I_SIZE, J_SIZE> M; |
 | Upper_Triangular_Strict_Matrix<T> M(I_size, J_size); | Tiny_Upper_Triangular_Strict_Matrix<T, I_SIZE, J_SIZE> M; |
 | Lower_Unit_Triangular_Matrix<T> M(I_size, J_size);   | Tiny_Lower_Unit_Triangular_Matrix<T, I_SIZE, J_SIZE> M;   |
 | Upper_Unit_Triangular_Matrix<T> MI_size, J_size);    | Tiny_Upper_Unit_Triangular_Matrix<T, I_SIZE, J_SIZE> M;   |
 |------------------------------------------------------+-----------------------------------------------------------|


 Please note that by default Symmetric/Hermitian matrices are stored in their *Lower* part.

 For each case you can also use *views*, there are two types of view:
 mutable one and constant one. For instance:

 #+begin_src cpp :eval never
Matrix<double> M(10, 5);

auto view = view_as_lower_triangular_strict(M.as_const());
 #+end_src

 will return a constant view (a lightweight matrix where only pointers
 are stored and not owned).

** Meta-Programming 

