docs/README.html

<div id="outline-container-orgb7d682a" class="outline-2">
<h2 id="orgb7d682a"><span class="section-number-2">3</span> Doc (Under construction)</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org1c19691" class="outline-3">
<h3 id="org1c19691"><span class="section-number-3">3.1</span> Types</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgc62a4b4" class="outline-4">
<h4 id="orgc62a4b4"><span class="section-number-4">3.1.1</span> Matrix types</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
For the moment I only have defined <code>dense</code> matrices (BLAS compatible with column major order):
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #cdad00;"> #include</span> <span style="color: #8b7355;">"LinearAlgebra/dense/matrix.hpp"</span>
<span style="color: #cdad00;"> #include</span> <span style="color: #8b7355;">"LinearAlgebra/dense/vector.hpp"</span>

<span style="color: #cdad00;"> #include</span> <span style="color: #8b7355;">&lt;iostream&gt;</span>

 <span style="color: #1c86ee;">using</span> <span style="color: #1c86ee;">namespace</span> <span style="color: #6e8b3d;">LinearAlgebra</span>;

 <span style="color: #00688b;">int</span>
 <span style="color: #cd9b1d;">main</span>()
 {
   <span style="color: #00688b;">Matrix</span>&lt;<span style="color: #00688b;">double</span>&gt; <span style="color: #2e8b57;">M_1</span>(4, 5);

   <span style="color: #00688b;">Symmetric_Matrix</span>&lt;<span style="color: #00688b;">int</span>&gt; <span style="color: #2e8b57;">M_2</span>(4, 4);

   <span style="color: #00688b;">Tiny_Strict_Lower_Triangular_Matrix</span>&lt;<span style="color: #00688b;">float</span>, 4, 7&gt; <span style="color: #2e8b57;">M_3</span>;

   <span style="color: #6e8b3d;">std</span>::cout &lt;&lt; M_1 &lt;&lt; <span style="color: #6e8b3d;">std</span>::endl;
   <span style="color: #6e8b3d;">std</span>::cout &lt;&lt; M_2 &lt;&lt; <span style="color: #6e8b3d;">std</span>::endl;
   <span style="color: #6e8b3d;">std</span>::cout &lt;&lt; M_3 &lt;&lt; <span style="color: #6e8b3d;">std</span>::endl;
 }
</pre>
</div>

<p>
prints
</p>

<pre class="example">

		0               0               0               0               0
		0               0               0               0               0
		0               0               0               0               0
		0               0               0               0               0

		0               X               X               X
		0               0               X               X
		0               0               0               X
		0               0               0               0

		X               X               X               X               X               X               X
		0               X               X               X               X               X               X
		0               0               X               X               X               X               X
		0               0    -6.63669e-18               X               X               X               X
</pre>

<p>
The generic definition for these matrix types is:
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #1c86ee;">template</span> &lt;T,                  <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">is the component type</span>
          SPECIAL_STRUCTURE,  <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">is in {None, Symmetric, Hermitian, Triangular,</span>
                              <span style="color: #7f7f7f;">//        </span><span style="color: #7f7f7f;">Unit_Triangular, Triangular_Strict}</span>
          MASK,               <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">is in {None, Upper, Upper_Strict, Lower, Lower_Strict }</span>
          N_TYPE,             <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">std::size_t or a std::integral_constant&lt;std::size_t,N&gt;</span>
          M_TYPE,             <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">std::size_t or a std::integral_constant&lt;std::size_t,M&gt;</span>
          LEADING_DIMENSION   <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">std::size_t or a std::integral_constant&lt;std::size_t,LD&gt;</span>
          &gt;                   <span style="color: #7f7f7f;">//</span>
<span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Default_Matrix</span>;         <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">or {Default_Matrix_View, Default_Matrix_Const_View}</span>
</pre>
</div>

<p>
There are some alias covering the usual cases:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Dynamic</th>
<th scope="col" class="org-left">Static</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Matrix&lt;T&gt; M(I_size, J_size);</td>
<td class="org-left">Tiny_Matrix&lt;T, I_SIZE, J_SIZE&gt; M;</td>
</tr>

<tr>
<td class="org-left">Symmetric_Matrix&lt;T&gt; M(I_size, J_size);</td>
<td class="org-left">Tiny_Symmetric_Matrix&lt;T, SIZE&gt; M;</td>
</tr>

<tr>
<td class="org-left">Hermitian_Matrix&lt;T&gt; M(I_size, J_size);</td>
<td class="org-left">Tiny_Hermitian_Matrix&lt;T, SIZE&gt; M;</td>
</tr>

<tr>
<td class="org-left">Lower_Triangular_Matrix&lt;T&gt; M(I_size, J_size);</td>
<td class="org-left">Tiny_Lower_Triangular_Matrix&lt;T, I_SIZE, J_SIZE&gt; M;</td>
</tr>

<tr>
<td class="org-left">Upper_Triangular_Matrix&lt;T&gt; M(I_size, J_size);</td>
<td class="org-left">Tiny_Upper_Triangular_Matrix&lt;T, I_SIZE, J_SIZE&gt; M;</td>
</tr>

<tr>
<td class="org-left">Lower_Triangular_Strict_Matrix&lt;T&gt; M(I_size, J_size);</td>
<td class="org-left">Tiny_Lower_Triangular_Strict_Matrix&lt;T, I_SIZE, J_SIZE&gt; M;</td>
</tr>

<tr>
<td class="org-left">Upper_Triangular_Strict_Matrix&lt;T&gt; M(I_size, J_size);</td>
<td class="org-left">Tiny_Upper_Triangular_Strict_Matrix&lt;T, I_SIZE, J_SIZE&gt; M;</td>
</tr>

<tr>
<td class="org-left">Lower_Unit_Triangular_Matrix&lt;T&gt; M(I_size, J_size);</td>
<td class="org-left">Tiny_Lower_Unit_Triangular_Matrix&lt;T, I_SIZE, J_SIZE&gt; M;</td>
</tr>

<tr>
<td class="org-left">Upper_Unit_Triangular_Matrix&lt;T&gt; MI_size, J_size);</td>
<td class="org-left">Tiny_Upper_Unit_Triangular_Matrix&lt;T, I_SIZE, J_SIZE&gt; M;</td>
</tr>
</tbody>
</table>


<p>
Please note that by default Symmetric/Hermitian matrices are stored in their <b>Lower</b> part.
</p>

<p>
For each case you can also use <b>views</b>, there are two types of view:
mutable one and constant one. For instance:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #00688b;">Matrix</span>&lt;<span style="color: #00688b;">double</span>&gt; <span style="color: #2e8b57;">M</span>(10, 5);

<span style="color: #1c86ee;">auto</span> <span style="color: #2e8b57;">view</span> = view_as_lower_triangular_strict(M.as_const());
</pre>
</div>

<p>
will return a constant view (a lightweight matrix where only pointers
are stored and not owned).
</p>
</div>
</div>
</div>
