docs/README.html

<div id="outline-container-org14574a9" class="outline-3">
<h3 id="org14574a9"><span class="section-number-3">3.2</span> Meta-Programming</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-orgc3077af" class="outline-4">
<h4 id="orgc3077af"><span class="section-number-4">3.2.1</span> Some size utils</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
<b>File</b>: <a href="src/LinearAlgebra/utils/size_utils.hpp">file:LinearAlgebra/utils/size_utils.hpp</a>
</p>

<ul class="org-ul">
<li><p>
<code>Has_Static_Capacity_v:</code> check if capacity is static or not (a static
capacity means that the object can be created without dynamic memory
allocation)
</p>
<div class="org-src-container">
<pre class="src src-cpp">static_assert(<span style="color: #1c86ee;">not</span> <span style="color: #00688b;">Has_Static_Capacity_v</span>&lt;<span style="color: #00688b;">Vector</span>&lt;<span style="color: #00688b;">double</span>&gt;&gt;);
static_assert(Has_Static_Capacity_v&lt;<span style="color: #00688b;">Tiny_Matrix</span>&lt;<span style="color: #00688b;">int</span>, 3, 4&gt;&gt;);
</pre>
</div></li>

<li><p>
<code>Has_Static_Size_v:</code> check if a vector has a static size
</p>
<div class="org-src-container">
<pre class="src src-cpp">static_assert(<span style="color: #00688b;">Has_Static_Size_v</span>&lt;<span style="color: #00688b;">Tiny_Vector</span>&lt;<span style="color: #00688b;">double</span>, 3&gt;&gt;);
static_assert(<span style="color: #1c86ee;">not</span> <span style="color: #00688b;">Has_Static_Size_v</span>&lt;<span style="color: #00688b;">Vector</span>&lt;<span style="color: #00688b;">double</span>&gt;&gt;);

static_assert(<span style="color: #1c86ee;">not</span> <span style="color: #00688b;">Has_Static_Size_v</span>&lt;<span style="color: #00688b;">Matrix</span>&lt;<span style="color: #00688b;">double</span>&gt;&gt;);  <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">safely</span>
                                                       <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">returns</span>
                                                       <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">false, even</span>
                                                       <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">if not a</span>
                                                       <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">vector type</span>
</pre>
</div></li>

<li><p>
<code>Any_Has_Static_Size_v:</code> check if any vector has a static size
</p>
<div class="org-src-container">
<pre class="src src-cpp"> static_assert(<span style="color: #00688b;">Any_Has_Static_Size_v</span>&lt;<span style="color: #00688b;">Vector</span>&lt;<span style="color: #00688b;">double</span>&gt;, <span style="color: #00688b;">Tiny_Vector</span>&lt;<span style="color: #00688b;">double</span>, 3&gt;&gt;);
</pre>
</div></li>

<li><p>
<code>Has_Static_I_Size_v:</code> check if a matrix has a static <code>I_size</code> (number of rows):
</p>
<div class="org-src-container">
<pre class="src src-cpp">  static_assert(<span style="color: #00688b;">Has_Static_I_Size_v</span>&lt;<span style="color: #00688b;">Tiny_Matrix</span>&lt;<span style="color: #00688b;">int</span>, 3, 4&gt;&gt;);
  static_assert(<span style="color: #1c86ee;">not</span> <span style="color: #00688b;">Has_Static_I_Size_v</span>&lt;<span style="color: #00688b;">Matrix</span>&lt;<span style="color: #00688b;">int</span>&gt;&gt;);
</pre>
</div></li>

<li><p>
<code>Has_Static_I_Size_v:</code> check if a matrix has a static <code>I_size</code> (number of rows):
</p>
<div class="org-src-container">
<pre class="src src-cpp">  static_assert(<span style="color: #00688b;">Has_Static_I_Size_v</span>&lt;<span style="color: #00688b;">Tiny_Matrix</span>&lt;<span style="color: #00688b;">int</span>, 3, 4&gt;&gt;);
  static_assert(<span style="color: #1c86ee;">not</span> <span style="color: #00688b;">Has_Static_I_Size_v</span>&lt;<span style="color: #00688b;">Matrix</span>&lt;<span style="color: #00688b;">int</span>&gt;&gt;);
</pre>
</div></li>

<li><p>
<code>Any_Static_I_Size_v:</code> check if any matrix has a static <code>I_size</code> (number of rows):
</p>
<div class="org-src-container">
<pre class="src src-cpp">static_assert(<span style="color: #00688b;">Any_Has_Static_I_Size_v</span>&lt;<span style="color: #00688b;">Vector</span>&lt;<span style="color: #00688b;">int</span>&gt;, <span style="color: #00688b;">Tiny_Matrix</span>&lt;<span style="color: #00688b;">int</span>, 3, 4&gt;&gt;);
</pre>
</div></li>

<li><code>Has_Static_J_Size_v:</code> same than <code>I_size</code> but for columns</li>
<li><code>Any_Static_J_Size_v:</code> same than <code>I_size</code> but for columns</li>
</ul>


<p>
TODO: move to function with links:
</p>

<p>
Two functions, declared as <code>constexpr</code>:
</p>
<ul class="org-ul">
<li><p>
<code>get_static_size_if_any(...)</code> that returns a static size if any. 
</p>

<p>
CAVEAT: it does not check if all sizes are equal!
</p></li>

<li><code>all_sizes_are_equal_p(...)</code> check that all sizes are equal</li>
</ul>
</div>
</div>

<div id="outline-container-org954ade9" class="outline-4">
<h4 id="org954ade9"><span class="section-number-4">3.2.2</span> Some generic matrix type predicates</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
<b>File:</b> <a href="src/LinearAlgebra/utils/sfinae_vmt_helpers.hpp">LinearAlgebra/utils/sfinae_vmt_helpers.hpp</a>
</p>

<p>
<b>Note</b>: these predicates will also work for sparse matrices (they are
      not restricted to dense one).
</p>

<p>
Checks if the matrix is defined by its lower or upper part:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">MATRIX</span>&gt;
<span style="color: #1c86ee;">constexpr</span> <span style="color: #00688b;">bool</span> <span style="color: #2e8b57;">Is_Upper_Matrix_Storage_v</span> = <span style="color: #6e8b3d;">Is_Upper_Matrix_Storage</span>&lt;<span style="color: #00688b;">MATRIX</span>&gt;::value;

<span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">MATRIX</span>&gt;
<span style="color: #1c86ee;">constexpr</span> <span style="color: #00688b;">bool</span> <span style="color: #2e8b57;">Is_Upper_Strict_Matrix_Storage_v</span> = <span style="color: #6e8b3d;">Is_Upper_Strict_Matrix_Storage</span>&lt;<span style="color: #00688b;">MATRIX</span>&gt;::value;

<span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">MATRIX</span>&gt;
<span style="color: #1c86ee;">constexpr</span> <span style="color: #00688b;">bool</span> <span style="color: #2e8b57;">Is_Lower_Matrix_Storage_v</span> = <span style="color: #6e8b3d;">Is_Lower_Matrix_Storage</span>&lt;<span style="color: #00688b;">MATRIX</span>&gt;::value;

<span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">MATRIX</span>&gt;
<span style="color: #1c86ee;">constexpr</span> <span style="color: #00688b;">bool</span> <span style="color: #2e8b57;">Is_Lower_Strict_Matrix_Storage_v</span> = <span style="color: #6e8b3d;">Is_Lower_Strict_Matrix_Storage</span>&lt;<span style="color: #00688b;">MATRIX</span>&gt;::value;
</pre>
</div>


<p>
Checks for special structure:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">MATRIX</span>&gt;
<span style="color: #1c86ee;">constexpr</span> <span style="color: #00688b;">bool</span> <span style="color: #2e8b57;">Is_Full_Matrix_v</span> = <span style="color: #6e8b3d;">Is_Full_Matrix</span>&lt;<span style="color: #00688b;">MATRIX</span>&gt;::value;

<span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">MATRIX</span>&gt;
<span style="color: #1c86ee;">constexpr</span> <span style="color: #00688b;">bool</span> <span style="color: #2e8b57;">Is_Symmetric_Matrix_v</span> = <span style="color: #6e8b3d;">Is_Symmetric_Matrix</span>&lt;<span style="color: #00688b;">MATRIX</span>&gt;::value;

<span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">MATRIX</span>&gt;
<span style="color: #1c86ee;">constexpr</span> <span style="color: #00688b;">bool</span> <span style="color: #2e8b57;">Is_Hermitian_Matrix_v</span> = <span style="color: #6e8b3d;">Is_Hermitian_Matrix</span>&lt;<span style="color: #00688b;">MATRIX</span>&gt;::value;

<span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">MATRIX</span>&gt;
<span style="color: #1c86ee;">constexpr</span> <span style="color: #00688b;">bool</span> <span style="color: #2e8b57;">Is_Triangular_Matrix_v</span> = <span style="color: #6e8b3d;">Is_Triangular_Matrix</span>&lt;<span style="color: #00688b;">MATRIX</span>&gt;::value;

<span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">MATRIX</span>&gt;
<span style="color: #1c86ee;">constexpr</span> <span style="color: #00688b;">bool</span> <span style="color: #2e8b57;">Is_Unit_Triangular_Matrix_v</span> = <span style="color: #6e8b3d;">Is_Unit_Triangular_Matrix</span>&lt;<span style="color: #00688b;">MATRIX</span>&gt;::value;
</pre>
</div>

<p>
<b>Usage example:</b>
</p>

<div class="org-src-container">
<pre class="src src-cpp">static_assert(<span style="color: #00688b;">Is_Symmetric_Matrix_v</span>&lt;<span style="color: #00688b;">Symmetric_Matrix</span>&lt;<span style="color: #00688b;">double</span>&gt;&gt;);
static_assert(<span style="color: #00688b;">Is_Lower_Matrix_Storage_v</span>&lt;<span style="color: #00688b;">Symmetric_Matrix</span>&lt;<span style="color: #00688b;">double</span>&gt;&gt;);
</pre>
</div>
</div>
</div>
</div>
