README.org
*** Aliasing 
    :PROPERTIES:
    :ID:       7207062d-f90b-4646-a5f0-dd692083176f
    :END:
    :BACKLINKS:
    [2020-04-25 Sat 16:39] <- [[id:4a5f5853-bb5d-4935-abd0-3996a3d62a4e][Same mathematical object]]
    :END:

Test if two objects are aliased or not.
#+BEGIN_SRC cpp :eval never
bool status = are_not_aliased_p(vector0, matrix1)
#+END_SRC

*Note:* it is easy/fast to check if two objects are *not* aliased (memory
blocks don't overlap). It can be more tricky (with all the possible
memory increments/strides) to check if two objects are aliased. That's
the reason why we also have this function:

#+BEGIN_SRC cpp :eval never
bool status = are_maybe_aliased_p(vector0, matrix1)
#+END_SRC

Also see: [[id:4a5f5853-bb5d-4935-abd0-3996a3d62a4e][Same mathematical object]]

*** Same mathematical object
    :PROPERTIES:
    :ID:       4a5f5853-bb5d-4935-abd0-3996a3d62a4e
    :END:

A predicate that checks if two objects represent *exactly* the same
"mathematical" object. By exactly we mean:
- same memory
- same dimension

This is possible, think to a matrix and its view.

#+BEGIN_SRC cpp :eval never
bool status = same_mathematical_object_p(matrix_1,matrix_2);
#+END_SRC

*Note:* according to the definition, two identical mathematical objects
are trivially [[id:7207062d-f90b-4646-a5f0-dd692083176f][Aliased]].

*** Similar
    :PROPERTIES:
    :ID:       5afec5bb-bd6c-4173-b513-3b49cef5005a
    :END:
    :BACKLINKS:
    [2020-04-24 Fri 12:50] <- [[id:07b3fa16-4842-4bf2-9893-7d6626813c9b][Copy]]
    :END:

 Create an *uninitialized* object of the same type and same dimension:
 #+BEGIN_SRC cpp :eval never
auto u = similar(v);
 #+END_SRC

 a variant is to change type:

 #+BEGIN_SRC cpp :eval never
Vector<double> v;
auto int_u = similar(Type_v<int>,v);
 #+END_SRC

*** Copy
    :PROPERTIES:
    :ID:       07b3fa16-4842-4bf2-9893-7d6626813c9b
    :END:

  Like [[id:5afec5bb-bd6c-4173-b513-3b49cef5005a][Similar]] but also performs a copy of the element

  #+BEGIN_SRC cpp :eval never
auto u = copy(v);
auto int_u = copy(Type_v<int>,v);
  #+END_SRC

*** lower/upper bound
    :PROPERTIES:
    :ID:       3ba0b7cf-95c2-436e-a90c-11e751898497
    :END:

These functions mimic =std::lower_bound=, =std::upper_bound= but work with indices.

  #+BEGIN_SRC cpp :eval never
// Returns the first index *idx* such "value <= x[idx]"
//         or X.size() if such element index does not exist
//
template <typename IMPL>
std::size_t
lower_bound(const Dense_Vector_Crtp<IMPL>& X, const Element_Type_t<IMPL>& value);

// Returns the first index *idx* such "value < x[idx]"
//         or X.size() if such element index does not exist
//
template <typename IMPL>
std::size_t
upper_bound(const Dense_Vector_Crtp<IMPL>& X, const Element_Type_t<IMPL>& value);
 #+END_SRC

They can be used to create view, see [[id:907674bf-2cae-4a34-8061-b5039240e93b][View from lower/upper bounds]]


* FAQ

** Resizable vector/matrix ?

In general vectors or matrices *cannot be resized*. 

This avoids introducing an asymmetry in the code between dynamic &
static size objects. This asymmetry would have come with some extra
complications both for the developer and the user who want to
implement some generic routines.

** Expression Template 

Only a reduced number of expressions are supported (TODO: list
them!). 

By example you can write
#+begin_src cpp :eval never
V=2*transpose(M)*U+2*V
 #+end_src
as this expression can be directly mapped to a Blas subroutine.

However, you cannot write, in full generality, things like:
#+begin_src cpp :eval never
V=2*transpose(M)*M**M*U+2*V
#+end_src

Please note that, all in all, this constraint has some positive side
effects as it reduces the "chance" of introducing hidden temporary
creations.

Also note that beside Expression Template you can call available
expressions using reverse polish notation, by example

#+begin_src cpp :eval never
V = 2 * transpose(M) * U + 3 * V
#+end_src

can be computed by calling:
#+begin_src cpp :eval never
assign(V, _plus_, _product_, _product_, 2, _transpose_, M, U, _product_, 3, _lhs_);
#+end_src


** Tiny objects & intrinsics

For the moment I have not introduced all the machinery that "manually"
generates simd code.  This would have required a lot to be introduced,
like cpu dependent simd definitions, =aligned= or =packed= template
parameters etc... Really not my priority for the moment... Some other
libs do a great job here.
