docs/README.html

<div id="outline-container-org1d5d887" class="outline-3">
<h3 id="org1d5d887"><span class="section-number-3">3.3</span> Functions</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-org7c36b46" class="outline-4">
<h4 id="org7c36b46"><a id="ID-7207062d-f90b-4646-a5f0-dd692083176f"></a><span class="section-number-4">3.3.1</span> Aliasing</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;Sat Apr 25 2020 16:39&gt;</span></span> &lt;- <a href="#org381e2a6">Same mathematical object</a>
</p>

<p>
Test if two objects are aliased or not.
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #00688b;">bool</span> <span style="color: #2e8b57;">status</span> = are_not_aliased_p(vector0, matrix1)
</pre>
</div>

<p>
<b>Note:</b> it is easy/fast to check if two objects are <b>not</b> aliased (memory
blocks don't overlap). It can be more tricky (with all the possible
memory increments/strides) to check if two objects are aliased. That's
the reason why we also have this function:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #00688b;">bool</span> <span style="color: #2e8b57;">status</span> = are_maybe_aliased_p(vector0, matrix1)
</pre>
</div>

<p>
Also see: <a href="#org381e2a6">Same mathematical object</a>
</p>
</div>
</div>

<div id="outline-container-org381e2a6" class="outline-4">
<h4 id="org381e2a6"><a id="ID-4a5f5853-bb5d-4935-abd0-3996a3d62a4e"></a><span class="section-number-4">3.3.2</span> Same mathematical object</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
A predicate that checks if two objects represent <b>exactly</b> the same
"mathematical" object. By exactly we mean:
</p>
<ul class="org-ul">
<li>same memory</li>
<li>same dimension</li>
</ul>

<p>
This is possible, think to a matrix and its view.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #00688b;">bool</span> <span style="color: #2e8b57;">status</span> = same_mathematical_object_p(matrix_1,matrix_2);
</pre>
</div>

<p>
<b>Note:</b> according to the definition, two identical mathematical objects
are trivially <a href="#org7c36b46">Aliased</a>.
</p>
</div>
</div>

<div id="outline-container-orga1d6344" class="outline-4">
<h4 id="orga1d6344"><a id="ID-5afec5bb-bd6c-4173-b513-3b49cef5005a"></a><span class="section-number-4">3.3.3</span> Similar</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;Fri Apr 24 2020 12:50&gt;</span></span> &lt;- <a href="#orgcc6bb79">Copy</a>
</p>

<p>
Create an <b>uninitialized</b> object of the same type and same dimension:
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #1c86ee;">auto</span> <span style="color: #2e8b57;">u</span> = similar(v);
</pre>
</div>

<p>
a variant is to change type:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #00688b;">Vector</span>&lt;<span style="color: #00688b;">double</span>&gt; <span style="color: #2e8b57;">v</span>;
<span style="color: #1c86ee;">auto</span> <span style="color: #2e8b57;">int_u</span> = similar(<span style="color: #00688b;">Type_v</span>&lt;<span style="color: #00688b;">int</span>&gt;,v);
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcc6bb79" class="outline-4">
<h4 id="orgcc6bb79"><a id="ID-07b3fa16-4842-4bf2-9893-7d6626813c9b"></a><span class="section-number-4">3.3.4</span> Copy</h4>
<div class="outline-text-4" id="text-3-3-4">
<p>
Like <a href="#orga1d6344">Similar</a> but also performs a copy of the element
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #1c86ee;">auto</span> <span style="color: #2e8b57;">u</span> = copy(v);
<span style="color: #1c86ee;">auto</span> <span style="color: #2e8b57;">int_u</span> = copy(<span style="color: #00688b;">Type_v</span>&lt;<span style="color: #00688b;">int</span>&gt;,v);
</pre>
</div>
</div>
</div>

<div id="outline-container-org2b27d05" class="outline-4">
<h4 id="org2b27d05"><a id="ID-3ba0b7cf-95c2-436e-a90c-11e751898497"></a><span class="section-number-4">3.3.5</span> lower/upper bound</h4>
<div class="outline-text-4" id="text-3-3-5">
<p>
These functions mimic <code>std::lower_bound</code>, <code>std::upper_bound</code> but work with indices.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Returns the first index *idx* such "value &lt;= x[idx]"</span>
<span style="color: #7f7f7f;">//         </span><span style="color: #7f7f7f;">or X.size() if such element index does not exist</span>
<span style="color: #7f7f7f;">//</span>
<span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">IMPL</span>&gt;
<span style="color: #6e8b3d;">std</span>::<span style="color: #00688b;">size_t</span>
<span style="color: #cd9b1d;">lower_bound</span>(<span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Dense_Vector_Crtp</span>&lt;<span style="color: #00688b;">IMPL</span>&gt;&amp; <span style="color: #2e8b57;">X</span>, <span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Element_Type_t</span>&lt;<span style="color: #00688b;">IMPL</span>&gt;&amp; <span style="color: #2e8b57;">value</span>);

<span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Returns the first index *idx* such "value &lt; x[idx]"</span>
<span style="color: #7f7f7f;">//         </span><span style="color: #7f7f7f;">or X.size() if such element index does not exist</span>
<span style="color: #7f7f7f;">//</span>
<span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">IMPL</span>&gt;
<span style="color: #6e8b3d;">std</span>::<span style="color: #00688b;">size_t</span>
<span style="color: #cd9b1d;">upper_bound</span>(<span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Dense_Vector_Crtp</span>&lt;<span style="color: #00688b;">IMPL</span>&gt;&amp; <span style="color: #2e8b57;">X</span>, <span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Element_Type_t</span>&lt;<span style="color: #00688b;">IMPL</span>&gt;&amp; <span style="color: #2e8b57;">value</span>);
</pre>
</div>

<p>
They can be used to create view, see <a href="#org4187a60">View from lower/upper bounds</a>
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-org5c310ea" class="outline-2">
<h2 id="org5c310ea"><span class="section-number-2">4</span> FAQ</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org4be03e6" class="outline-3">
<h3 id="org4be03e6"><span class="section-number-3">4.1</span> Resizable vector/matrix ?</h3>
<div class="outline-text-3" id="text-4-1">
<p>
In general vectors or matrices <b>cannot be resized</b>. 
</p>

<p>
This avoids introducing an asymmetry in the code between dynamic &amp;
static size objects. This asymmetry would have come with some extra
complications both for the developer and the user who want to
implement some generic routines.
</p>
</div>
</div>

<div id="outline-container-org0b6c96b" class="outline-3">
<h3 id="org0b6c96b"><span class="section-number-3">4.2</span> Expression Template</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Only a reduced number of expressions are supported (TODO: list
them!). 
</p>

<p>
By example you can write
</p>
<div class="org-src-container">
<pre class="src src-cpp">V=2*transpose(M)*U+2*V
</pre>
</div>
<p>
as this expression can be directly mapped to a Blas subroutine.
</p>

<p>
However, you cannot write, in full generality, things like:
</p>
<div class="org-src-container">
<pre class="src src-cpp">V=2*transpose(M)*M**M*U+2*V
</pre>
</div>

<p>
Please note that, all in all, this constraint has some positive side
effects as it reduces the "chance" of introducing hidden temporary
creations.
</p>

<p>
Also note that beside Expression Template you can call available
expressions using reverse polish notation, by example
</p>

<div class="org-src-container">
<pre class="src src-cpp">V = 2 * transpose(M) * U + 3 * V
</pre>
</div>

<p>
can be computed by calling:
</p>
<div class="org-src-container">
<pre class="src src-cpp">assign(V, _plus_, _product_, _product_, 2, _transpose_, M, U, _product_, 3, _lhs_);
</pre>
</div>
</div>
</div>


<div id="outline-container-orgea6fa12" class="outline-3">
<h3 id="orgea6fa12"><span class="section-number-3">4.3</span> Tiny objects &amp; intrinsics</h3>
<div class="outline-text-3" id="text-4-3">
<p>
For the moment I have not introduced all the machinery that "manually"
generates simd code.  This would have required a lot to be introduced,
like cpu dependent simd definitions, <code>aligned</code> or <code>packed</code> template
parameters etc&#x2026; Really not my priority for the moment&#x2026; Some other
libs do a great job here.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: picaud</p>
<p class="date">Created: 2020-07-17 Fri 08:04</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
